# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# SOD-GCn backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]]  # 0-P2/4
  - [-1, 6, Ghost_HGBlock, [48, 128, 3]]  # stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8
  - [-1, 6, Ghost_HGBlock, [96, 512, 3]]   # stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 4-P4/16
  - [-1, 6, Ghost_HGBlock, [192, 1024, 5, True, False]]  # cm, c2, k, light, shortcut
  - [-1, 6, Ghost_HGBlock, [192, 1024, 5, True, True]]
  - [-1, 6, Ghost_HGBlock, [192, 1024, 5, True, True]]  # stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 8-P5/32
  - [-1, 6, Ghost_HGBlock, [384, 2048, 5, True, False]]  # stage 4
  - [-1, 1, FeaturePyramidSharedConv, [1024]]  # 10
  - [-1, 2, C2PSA, [1024]] # 11

# SOD-GCn head
head:
  - [[-1, 7], 1, SBA, []] # 12 (P4/16)
  - [-1, 2, C3k2, [512, False]] # 13

  - [[-1, 3], 1, SBA, []] # 14 (P3/8)
  - [-1, 2, C3k2, [256, False]] # 15

  - [[-1, 1], 1, SBA, []] # 16 (P2/4)
  - [-1, 2, C3k2, [128, False]] # 17

  - [[-1, 14], 1, SBA, []] # 18 (P3/8)
  - [-1, 2, C3k2, [256, False]] # 19

  - [[-1, 12], 1, SBA, []] # 20 (P4/16)
  - [-1, 2, C3k2, [512, False]] # 21

  - [[-1, 10], 1, SBA, []] # 22 (P5/32)
  - [-1, 2, C3k2, [1024, True]] # 23

  - [[17, 19, 21, 23], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)
